import { RecyclingPoint } from '@services/collection-points.service';

export const CollecionPointsMock: RecyclingPoint[] = [
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Пластик, стекло, бумага, металл, старая одежда, батареи, аккумуляторы...",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Стекло, бумага, металл, старая одежда, батареи",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Пластик, стекло, бумага, металл",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Стекло, бумага, металл, старая одежда, батареи",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Пластик, стекло, бумага, металл, старая одежда, батареи, аккумуляторы...",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Стекло, бумага, металл, старая одежда, батареи",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Пластик, стекло, бумага, металл",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	},
	{
		address: "ул.Кремлёвская, 88",
		accepts: "Стекло, бумага, металл, старая одежда, батареи",
		image_src: "assets/recyclingPoint.png",
		phone_number: "+7 (917) 888 88 88",
		hours: { "Пн - Пт": "08:00 - 20:00", "Сб - Вс": "10:00 - 18:00" },
		companies: [
			{
				name: "H&M",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг", "Батареи: от 2 кг"]
			},
			{
				name: "Adidas",
				accepts: ["Пластик: от 5 кг", "Стекло: от 2 кг", "Бумага: от 10 кг"]
			}
		]
	}
]
